Тестовая_база_ERP_14/src/Catalogs/CRM_ЭтапыПроектов/CRM_ЭтапыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ЭтапыПроектов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание этапа</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеHTML</name>
    <comment>Описание этапа в HTML</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммарнаяДатаНачалаПлановая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммарнаяДатаОкончанияПлановая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммарнаяДлительностьПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммарнаяДатаНачалаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммарнаяДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммарнаяДлительностьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <comment>Затраты этапа</comment>
    <attributes>
      <name>СтатьяЗатрат</name>
      <comment>Статья затрат</comment>
      <type>
        <types>CatalogRef.CRM_СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма затрат</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Комментарий</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/CRM_СтатусыЭтаповКалендарногоПлана/CRM_СтатусыЭтаповКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыЭтаповКалендарногоПлана</name>
  <enumValues>
    <name>Запланирована</name>
    <comment>Используется при создании</comment>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Проверена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/CRM_ЭтапКалендарногоПлана/CRM_ЭтапКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_ЭтапКалендарногоПлана</name>
  <basedOn>Catalog.CRM_ЭтапыПроектов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.CRM_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаОкончания</name>
    <comment>Фактическая дата окончания задачи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <comment>Описание результата закрытия точки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыЭтаповКалендарногоПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Название задачи проекта или контрольной точки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.CRM_ТипыЭтапов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОтменыЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <comment>Признак того что этап введен вручную</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыКонтекстаФайлов</name>
    <attributes>
      <name>ВариантКонтекстаФайлов</name>
      <type>
        <types>CatalogRef.CRM_ВариантыКонтекстаФайла</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Смещения</name>
    <comment>История смещения сроков КТ</comment>
    <attributes>
      <name>СмещениеДатаНачало</name>
      <comment>История смещенной даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеДатаОкончание</name>
      <comment>История смещений даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>обязателен для заполнения</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <comment>Участники и ответственные по задаче/контрольной точке</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>Признак ответственного</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйДляОтбора</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Catalogs/CRM_ЭтапыПроектов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Ссылка.Пустая() Тогда
		ОпределитьДатыПакетаЗадач();
		Если Родитель <> Ссылка.Родитель Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийРодитель", Ссылка.Родитель);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПредыдущийРодитель") Тогда
		// Обновим все даты всех родителей этого этапа (если родитель был изменен).
		Если ЗначениеЗаполнено(Родитель) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьДатыПакетаЗадачИВсехРодителей(Родитель);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДополнительныеСвойства.ПредыдущийРодитель) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьДатыПакетаЗадачИВсехРодителей(ДополнительныеСвойства.ПредыдущийРодитель);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
	Описание = "";
	ОписаниеHTML = "";
	Затраты.Очистить();
	СуммарнаяДатаНачалаПлановая = "";
	СуммарнаяДатаНачалаФакт = "";
	СуммарнаяДатаОкончанияПлановая = "";
	СуммарнаяДатаОкончанияФакт = "";
	СуммарнаяДлительностьПлановая = "";
	СуммарнаяДлительностьФакт = "";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОпределитьДатыПакетаЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроекта.Ссылка КАК Ссылка,
		|	МИНИМУМ(ЗадачаПроекта.ПлановаяДатаНачала) КАК ПлановаяДатаНачала,
		|	МАКСИМУМ(ЗадачаПроекта.ПлановаяДатаОкончания) КАК ПлановаяДатаОкончания,
		|	МИНИМУМ(ЗадачаПроекта.ФактическаяДатаНачала) КАК ФактическаяДатаНачала,
		|	МАКСИМУМ(ЗадачаПроекта.ФактическаяДатаОкончания) КАК ДатаЗакрытияМакс,
		|	МИНИМУМ(ЗадачаПроекта.ФактическаяДатаОкончания) КАК ДатаЗакрытияМин
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.CRM_ЭтапКалендарногоПлана КАК ЗадачаПроекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ЭтапыПроектов КАК ЭтапПроекта
		|		ПО ЗадачаПроекта.Этап = ЭтапПроекта.Ссылка
		|			И (НЕ ЗадачаПроекта.ПометкаУдаления)
		|			И НЕ ЗадачаПроекта.Статус = ЗНАЧЕНИЕ(Перечисление.CRM_СтатусыЭтаповКалендарногоПлана.Отменена)
		|ГДЕ
		|	ЭтапПроекта.Ссылка В ИЕРАРХИИ(&ЭтаСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭтапПроекта.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВременнаяТаблица.ПлановаяДатаНачала) КАК ПлановаяДатаНачала,
		|	МАКСИМУМ(ВременнаяТаблица.ПлановаяДатаОкончания) КАК ПлановаяДатаОкончания,
		|	МИНИМУМ(ВременнаяТаблица.ФактическаяДатаНачала) КАК ФактическаяДатаНачала,
		|	МАКСИМУМ(ВременнаяТаблица.ДатаЗакрытияМакс) КАК ДатаЗакрытияМакс,
		|	МИНИМУМ(ВременнаяТаблица.ДатаЗакрытияМин) КАК ДатаЗакрытияМин
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица";
	
	Запрос.УстановитьПараметр("ЭтаСсылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СуммарнаяДатаНачалаПлановая = ВыборкаДетальныеЗаписи.ПлановаяДатаНачала;
		СуммарнаяДатаОкончанияПлановая = ВыборкаДетальныеЗаписи.ПлановаяДатаОкончания;
		СуммарнаяДатаНачалаФакт = ВыборкаДетальныеЗаписи.ФактическаяДатаНачала;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаЗакрытияМин) Тогда
			СуммарнаяДатаОкончанияФакт = ВыборкаДетальныеЗаписи.ДатаЗакрытияМакс;
		Иначе
			СуммарнаяДатаОкончанияФакт = Дата(1,1,1);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СуммарнаяДатаОкончанияПлановая) Тогда
			СуммарнаяДлительностьПлановая = (КонецДня(СуммарнаяДатаОкончанияПлановая) - НачалоДня(СуммарнаяДатаНачалаПлановая) + 1) / 86400;
		Иначе	
			СуммарнаяДлительностьПлановая = 0;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СуммарнаяДатаОкончанияФакт) Тогда
			СуммарнаяДлительностьФакт = (КонецДня(СуммарнаяДатаОкончанияФакт) - НачалоДня(СуммарнаяДатаНачалаФакт) + 1) / 86400;
		Иначе
			СуммарнаяДлительностьФакт = 0;
		КонецЕсли;
	Иначе
		СуммарнаяДатаНачалаПлановая = Дата(1,1,1);
		СуммарнаяДатаОкончанияПлановая = Дата(1,1,1);
		СуммарнаяДатаНачалаФакт = Дата(1,1,1);
		СуммарнаяДатаОкончанияФакт = Дата(1,1,1);
		СуммарнаяДлительностьПлановая = 0;
		СуммарнаяДлительностьФакт = 0;
	КонецЕсли;
	

КонецПроцедуры


#КонецЕсли
